       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       BEGIN.
       DISPLAY "Hello World!".
       STOP RUN.
